test_result/fio-3.28-4R5J0001-sr-1G-qd1-num1-32K-3000-WT.txt
fio-3.28-4R5J0001-read-1G-1-1-32K: (g=0): rw=read, bs=(R) 32.0KiB-32.0KiB, (W) 32.0KiB-32.0KiB, (T) 32.0KiB-32.0KiB, ioengine=libaio, iodepth=1
fio-3.28
Starting 1 process
{
  "fio version" : "fio-3.28",
  "timestamp" : 1750685869,
  "timestamp_ms" : 1750685869882,
  "time" : "Mon Jun 23 21:37:49 2025",
  "jobs" : [
    {
      "jobname" : "fio-3.28-4R5J0001-read-1G-1-1-32K",
      "groupid" : 0,
      "error" : 0,
      "eta" : 0,
      "elapsed" : 7,
      "job options" : {
        "name" : "fio-3.28-4R5J0001-read-1G-1-1-32K",
        "filename" : "/dev/sda",
        "rw" : "read",
        "bs" : "32K",
        "size" : "1G",
        "runtime" : "3000",
        "ioengine" : "libaio",
        "direct" : "1",
        "iodepth" : "1",
        "numjobs" : "1",
        "group_reporting" : "1",
        "ramp_time" : "0"
      },
      "read" : {
        "io_bytes" : 1073741824,
        "io_kbytes" : 1048576,
        "bw_bytes" : 181774475,
        "bw" : 177514,
        "iops" : 5547.316743,
        "runtime" : 5907,
        "total_ios" : 32768,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 3546,
          "max" : 87001,
          "mean" : 20942.053467,
          "stddev" : 13936.312115,
          "N" : 32768
        },
        "clat_ns" : {
          "min" : 51710,
          "max" : 297942,
          "mean" : 155414.243896,
          "stddev" : 58729.904206,
          "N" : 32768,
          "percentile" : {
            "1.000000" : 73216,
            "5.000000" : 74240,
            "10.000000" : 75264,
            "20.000000" : 124416,
            "30.000000" : 127488,
            "40.000000" : 128512,
            "50.000000" : 136192,
            "60.000000" : 146432,
            "70.000000" : 175104,
            "80.000000" : 234496,
            "90.000000" : 246784,
            "95.000000" : 254976,
            "99.000000" : 264192,
            "99.500000" : 268288,
            "99.900000" : 272384,
            "99.950000" : 276480,
            "99.990000" : 280576
          },
          "bins" : {
            "51456" : 1,
            "51968" : 3,
            "52480" : 4,
            "52992" : 1,
            "55552" : 1,
            "59648" : 1,
            "60672" : 1,
            "63744" : 1,
            "66048" : 1,
            "67072" : 10,
            "68096" : 5,
            "69120" : 2,
            "73216" : 520,
            "74240" : 2000,
            "75264" : 1668,
            "76288" : 721,
            "77312" : 313,
            "78336" : 132,
            "79360" : 35,
            "80384" : 15,
            "81408" : 9,
            "82432" : 5,
            "83456" : 6,
            "84480" : 5,
            "85504" : 6,
            "86528" : 4,
            "87552" : 7,
            "88576" : 11,
            "89600" : 8,
            "90624" : 12,
            "91648" : 7,
            "92672" : 8,
            "93696" : 1,
            "96768" : 1,
            "97792" : 3,
            "98816" : 2,
            "99840" : 3,
            "100864" : 1,
            "101888" : 2,
            "102912" : 2,
            "103936" : 2,
            "104960" : 3,
            "105984" : 2,
            "108032" : 3,
            "110080" : 1,
            "111104" : 1,
            "112128" : 3,
            "113152" : 5,
            "114176" : 30,
            "115200" : 43,
            "116224" : 51,
            "117248" : 28,
            "118272" : 12,
            "119296" : 24,
            "120320" : 70,
            "121344" : 91,
            "122368" : 185,
            "123392" : 292,
            "124416" : 385,
            "125440" : 935,
            "126464" : 1792,
            "127488" : 2404,
            "128512" : 2090,
            "129536" : 1289,
            "130560" : 565,
            "132096" : 387,
            "134144" : 109,
            "136192" : 69,
            "138240" : 95,
            "140288" : 208,
            "142336" : 453,
            "144384" : 1199,
            "146432" : 2268,
            "148480" : 790,
            "150528" : 177,
            "152576" : 35,
            "154624" : 23,
            "156672" : 22,
            "158720" : 24,
            "160768" : 29,
            "162816" : 22,
            "164864" : 113,
            "166912" : 236,
            "168960" : 137,
            "171008" : 123,
            "173056" : 315,
            "175104" : 420,
            "177152" : 311,
            "179200" : 160,
            "181248" : 281,
            "183296" : 198,
            "185344" : 116,
            "187392" : 48,
            "189440" : 34,
            "191488" : 27,
            "193536" : 27,
            "195584" : 19,
            "197632" : 18,
            "199680" : 14,
            "201728" : 8,
            "203776" : 4,
            "205824" : 6,
            "207872" : 5,
            "209920" : 4,
            "211968" : 13,
            "214016" : 43,
            "216064" : 61,
            "218112" : 68,
            "220160" : 59,
            "222208" : 74,
            "224256" : 93,
            "226304" : 136,
            "228352" : 216,
            "230400" : 285,
            "232448" : 326,
            "234496" : 611,
            "236544" : 892,
            "238592" : 809,
            "240640" : 568,
            "242688" : 366,
            "244736" : 329,
            "246784" : 289,
            "248832" : 330,
            "250880" : 290,
            "252928" : 440,
            "254976" : 479,
            "257024" : 470,
            "259072" : 355,
            "261120" : 265,
            "264192" : 278,
            "268288" : 171,
            "272384" : 53,
            "276480" : 12,
            "280576" : 6,
            "288768" : 2,
            "296960" : 1
          }
        },
        "lat_ns" : {
          "min" : 62555,
          "max" : 318756,
          "mean" : 176798.989410,
          "stddev" : 66746.363618,
          "N" : 32768
        },
        "bw_min" : 171968,
        "bw_max" : 188032,
        "bw_agg" : 100.000000,
        "bw_mean" : 177675.636364,
        "bw_dev" : 5411.223138,
        "bw_samples" : 11,
        "iops_min" : 5374,
        "iops_max" : 5876,
        "iops_mean" : 5552.363636,
        "iops_stddev" : 169.100723,
        "iops_samples" : 11
      },
      "write" : {
        "io_bytes" : 0,
        "io_kbytes" : 0,
        "bw_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "clat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 0,
        "iops_min" : 0,
        "iops_max" : 0,
        "iops_mean" : 0.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 0
      },
      "trim" : {
        "io_bytes" : 0,
        "io_kbytes" : 0,
        "bw_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "clat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 0,
        "iops_min" : 0,
        "iops_max" : 0,
        "iops_mean" : 0.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 0
      },
      "sync" : {
        "total_ios" : 0,
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        }
      },
      "job_runtime" : 5906,
      "usr_cpu" : 5.299695,
      "sys_cpu" : 19.387064,
      "ctx" : 32770,
      "majf" : 0,
      "minf" : 19,
      "iodepth_level" : {
        "1" : 100.000000,
        "2" : 0.000000,
        "4" : 0.000000,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        ">=64" : 0.000000
      },
      "iodepth_submit" : {
        "0" : 0.000000,
        "4" : 100.000000,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        "64" : 0.000000,
        ">=64" : 0.000000
      },
      "iodepth_complete" : {
        "0" : 0.000000,
        "4" : 100.000000,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        "64" : 0.000000,
        ">=64" : 0.000000
      },
      "latency_ns" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000
      },
      "latency_us" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 16.882324,
        "250" : 74.572754,
        "500" : 8.544922,
        "750" : 0.000000,
        "1000" : 0.000000
      },
      "latency_ms" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000,
        "2000" : 0.000000,
        ">=2000" : 0.000000
      },
      "latency_depth" : 1,
      "latency_target" : 0,
      "latency_percentile" : 100.000000,
      "latency_window" : 0
    }
  ],
  "disk_util" : [
    {
      "name" : "sda",
      "read_ios" : 32640,
      "write_ios" : 0,
      "read_merges" : 0,
      "write_merges" : 0,
      "read_ticks" : 4993,
      "write_ticks" : 0,
      "in_queue" : 4993,
      "util" : 98.494480
    }
  ]
}

fio-3.28-4R5J0001-read-1G-1-1-32K: (groupid=0, jobs=1): err= 0: pid=82745: Mon Jun 23 21:37:49 2025
  read: IOPS=5547, BW=173MiB/s (182MB/s)(1024MiB/5907msec)
    slat (nsec): min=3546, max=87001, avg=20942.05, stdev=13936.31
    clat (usec): min=51, max=297, avg=155.41, stdev=58.73
     lat (usec): min=62, max=318, avg=176.80, stdev=66.75
    clat percentiles (usec):
     |  1.00th=[   74],  5.00th=[   75], 10.00th=[   76], 20.00th=[  125],
     | 30.00th=[  128], 40.00th=[  129], 50.00th=[  137], 60.00th=[  147],
     | 70.00th=[  176], 80.00th=[  235], 90.00th=[  247], 95.00th=[  255],
     | 99.00th=[  265], 99.50th=[  269], 99.90th=[  273], 99.95th=[  277],
     | 99.99th=[  281]
   bw (  KiB/s): min=171968, max=188032, per=100.00%, avg=177675.64, stdev=5411.22, samples=11
   iops        : min= 5374, max= 5876, avg=5552.36, stdev=169.10, samples=11
  lat (usec)   : 100=16.88%, 250=74.57%, 500=8.54%
  cpu          : usr=5.30%, sys=19.39%, ctx=32770, majf=0, minf=19
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=32768,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=173MiB/s (182MB/s), 173MiB/s-173MiB/s (182MB/s-182MB/s), io=1024MiB (1074MB), run=5907-5907msec

Disk stats (read/write):
  sda: ios=32640/0, merge=0/0, ticks=4993/0, in_queue=4993, util=98.49%